x = 38
print('Дратути!')
if x < 0:
    print('меньше нуля')
print('Дотвидания!')

# Примеры

a, b = 10, 5
if a > b:
    print('a > b')
if a > b and a > 0:
    print('успех')
if a > b and (a > 0 or b < 1000):
    print('успех')
if 5 < b and b < 10:
    print('успех')

# Можно сравнивать - числа, строки, списки.

if '34' > '121':
    print('успех')
if '123' > '12':
    print('успех')
if [1, 2] > [1, 1]:
    print('успех')

# Что нельзя сравнивать - разныетипы.

if '6' > 5:
    print('успех')
if [5, 6] > 5:
    print('успех')

# Но -

if '6' != 5:
    print('успех')
    
